Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །སྒོ་དགུ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར།
en: Surrounded by nine openings.”

source: །ཀྱེ་བཅོམ་ལྡན་འདས་སྦྱོར་བ་གསུམ་ནི་ཅི་ཞེས་བཤད།
en: “O Blessed One, to what does triple mechanism refer?

source: །ཇི་ལྟར་གང་གི་རྣམ་པ་ཡིས། །སེམས་ཀྱི་རྟག་ཏུ་འགྲོ་བ་ལགས།
en: Why and how is mind always in motion?”

source: །གསུམ་ཉིད་སྦྱོར་བ་སྦྱོར་བ་གསུམ།
en: “There are three mechanisms, hence a triple mechanism,

source: །རྣམ་གསུམ་དབྱེ་བས་རྣམ་པར་གནས།
en: Established as threefold in terms of its parts.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་རང་བཞིན་གྱིས།
en: Having the nature of body, speech, and mind,

source: །ཐ་མ་འབྲིང་པོ་དམ་པ་ཉིད།
en: There are lesser, middling, and superior functions, respectively.

source: །ཀ་བ་གཅིག་དང་སྒོ་དགུ་པ།
en: “The body has one thick pillar, the ninefold door,

source: །སྦོམ་པོ་ལྔ་ནི་ལྷག་པའི་ལྷ།
en: And five presiding deities.

source: །བུག་པ་དགུར་ནི་སོན་པའི་སྒོ།
en: This door is the nine orifices,

source: །དགུ་ཡི་རྣམ་པར་ཡོངས་སུ་གྲགས།
en: Therefore it is proclaimed to be ninefold.

source: །ཐ་མའི་སྒ་ནི་སྐུར་ལྡན་པ།
en: “The lower opening is that of the body—

source: །སྦོམ་པོ་ལྷ་ཡི་སྤྲུལ་པའོ།
en: It is thick and fashioned by deities.

source: །སེམས་དང་སྐྱེས་བུ་སྐྱེས་བུ་ཅན།
en: Because of his mental faculty, a man is exceptional,

source: །ཁྱད་པར་རྣལ་འབྱོར་པ་ཡི་དོན།
en: Meaning that he is a practitioner. “The movement is distinguished by motion,

source: །རྟག་པར་ཀུན་དུ་དུས་སུ་ནི།
en: Regularly, at every moment.

source: །འགྲོ་དང་འོང་བའི་ཁྱད་པར་ལས།
en: Thus, in the case of monopeds,

source: །རྐང་མེད་རྐང་གཅིག་རྐང་གཉིས་དང་། །རྐང་བཞི་ལ་ནི་སོགས་པ་ཡི།
en: Bipeds, and quadrupeds, “Movement is always typified

source: །རླུང་ལ་སོགས་པས་རབ་དབྱེ་བས།
en: By the types of wind belonging to them.

source: །རྟག་ཏུ་འགྲོ་བ་རླུང་རྣམ་བཞི།
en: The wind is fourfold;

source: །སེམས་ཀྱི་གནས་པ་རྣམ་པ་གཉིས། །ནུབ་དང་རབ་རྒྱུའི་ཆོ་ག་ཡིས།
en: The mind’s mode of resting is twofold.

source: །རྟག་ཏུ་ནུབ་དང་རབ་རྒྱུ་བ།
en: “Through the process of dissolving and circulating the winds, the resting of dissolving and the motion of circulating will always extend to all beings.

source: །སེམས་ཅན་ཀུན་ལ་འགྲོ་བའོ། །དེ་ལྟར་གང་ཞིག་མི་རིག་པ། །སེམས་མེད་སྐྱེད་བུ་མེད་པ་དང་། །ཡིད་དང་ལྡན་པ་མེད་པ་དང་། །རྣལ་འབྱོར་པ་ཡི་དོན་མེད་པ།
en: He who does not know that is mindless, unexceptional, and unintelligent, meaning that he is not a practitioner.

source: །མེ་ཉིད་གང་དང་རླུང་དང་ནི།
en: “In the southeast, the northeast,

source: །དབང་ཆེན་དང་ནི་དེ་བཞིན་ཆུ།
en: The east, and the west

source: །འཁོར་ལོར་སེམས་ཀྱི་ཀུན་སྤྱོད་པ།
en: Are cakras, where mind’s movement

source: །སྟེང་དང་ངོས་དང་བྲང་འོག་འགྲོ།
en: Courses upward, toward the sides, straight, and downward.

source: །ཟླ་བ་ཉི་མའི་རབ་དབྱེ་བས།
en: “Following the division between the moon and the sun,

source: །གསུམ་པའི་སྒོ་ནི་ཡིད་དང་བཅས།
en: The third opening is that of the mind.

source: །རྔུབ་དང་དབྱུང་བ་གཉིས་ཀ་ཡང་།
en: As it involves both entering and exiting,

source: །སྒོ་ཡི་དམ་པ་ཉིད་ཡིན་ཏེ།
en: This is the most exalted opening.

source: །གཙོ་བོ་དམ་པ་ཡི་ནི་སྒོ།
en: “It is the main one, the supreme opening,

source: །སྟེང་དང་འོག་ཏུ་རབ་ཏུ་གྲགས།
en: Said to be directed both upward and downward.

source: །འོག་གི་སྒོས་ནི་རྣམ་པར་ཤེས།
en: Consciousness moves through the lower opening,

source: །སྟེང་གི་སྒོས་ནི་དབྱིངས་ཉིད་དེ།
en: And the elements move through the upper.

source: །རྣམ་སྣང་ལ་སོགས་སངས་རྒྱས་རྣམས།
en: “The five buddhas—Vairocana, and so forth—

source: །སྟེང་གི་སྒོར་ནི་གཡོ་ཞིང་གནས།
en: Move toward and settle in the upper opening.

source: །དེ་རྣམས་འོག་ཏུ་རྣམ་པར་གནས།
en: They are situated below,

source: །སྟེང་གིས་གཤེགས་སུ་གསོལ་བ་ཉིད། །སྤྱན་དྲངས་གཤེགས་སུ་གསོལ་བ་ཡི།
en: But are requested to depart upward.

source: །ཚུལ་གྱི་སེམས་ཀྱིས་རྟག་ཏུ་འགྲོ།
en: “The mind always moves them By way of invitation and request to depart.

source: །དུས་གསུམ་སངས་རྒྱས་ཐམས་ཅད་དང་། །མཁའ་འགྲོ་རྣལ་འབྱོར་མ་མོ་རྣམས།
en: All the buddhas of the three times And the ḍākinīs, the mothers of yogins, “Activate good and bad qualities

source: །འཇུག་པ་དང་ནི་ལྡོག་པ་ལ།
en: When brought in and expelled,

source: །ཡོན་ཏན་སྐྱོན་ནི་རབ་བརྗོད་པས། །བདེ་དང་སྡུག་བསྔལ་རང་བཞིན་གྱིས།
en: Their natures thus being pleasure and pain respectively.

source: །ལྷན་ཅིག་སྐྱེས་པ་གྲུབ་པའི་གནས།
en: As an accomplished being, one will abide in the innate state.”

source: །རྡོ་རྗེ་སེམས་དཔའ་བདེ་ཆེན་པོ། །བཅོམ་ལྡན་རྡོ་རྗེ་ཅན་གྱིས་གསུངས།
en: So spoke the blessed vajra holder, Vajrasattva, the great bliss.

source: །དེ་ནས་བཅོམ་ལྡན་ལྷ་མོས་ནི།
en: Now, the goddess, having inserted

source: །བོལླ་ཀཀྐོ་ལར་བཅུག་ནས།
en: The lord’s bola into her kakkola

source: །སེམས་དཔའ་ཆེན་པོ་མཉེས་བྱས་ཏེ།
en: Gratified the great being

source: །ཚིག་ནི་འདི་དག་ཡང་དག་གསོལ།
en: And spoke these words:

source: །དཔྱིད་ཅེས་བགྱི་བ་ཇི་ལྟར་ལགས།
en: “Why is your name Vasanta

source: །ཐིག་ལེ་བགྱི་བ་ཇི་ལྟར་ལགས།
en: What is the characteristic of Tilakā

source: །མི་ཕྱེད་ལ་སོགས་ཇི་ལྟར་གནས།
en: How can there be a place for them For someone abiding in nonduality, and so forth?

source: །དེ་ཡི་གནས་ནི་ཇི་ལྟར་ལགས།
en: “Explain to me how Pullīramalaya and the rest

source: །པུལླཱི་ར་སོགས་ཅི་གསུངས་དང་། །འཁོར་ལོ་དགོད་པ་དེ་བཞིན་གཞན།
en: Are said to relate to the distribution of cakras and other entities.

source: །ཇི་ལྟར་རྩ་ཡི་རྫོགས་པ་ཡི།
en: From what do the subtle energy channels emerge?

source: །དེ་ཡི་དབྱེ་བ་བདག་ལ་གསུངས།
en: Tell me what categories these entities fall into.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །ལྷ་མོ་བཤད་པར་བྱ་ཡིས་ཉོན།
en: The Blessed One said, “Listen, O goddess.

source: །གསང་བ་ལས་ནི་ཆེས་གསང་མཆོག །རྩའི་རང་བཞིན་དང་། གནས་ལ་སོགས་པ་དང་། ས་བཅུ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྐུ་དང་། གསུང་དང་། ཐུགས་ཀྱི་འཁོར་ལོར་སོན་པ་གནས་ཀྱི་ནང་གི་རབ་ཏུ་དབྱེ་བས་ཉི་ཤུ་རྩ་བཞིར་གསུངས་པ།
en: I will now explain the ultimate secret of secrets. “The division of pīṭhas and other pilgrimage places, which correspond in their nature to the subtle channels, is said to be twenty-four-fold. They are found within the cakras of the body, speech, and mind of living beings. They are further linked to the ten bodhisattva levels and the ten perfections.

source: སྤྱི་བོ་མཱ་ལ་ཡ་ཡི་ཡུལ།
en: “The head is the land of Malaya;

source: །དེ་བཞིན་སྤྱི་གཙུག་འབར་བ་འཛིན།
en: The topknot is Jālandhara.’

source: །དེ་བཞིན་དུ་ནི་ཨོ་ཌྱན་ཉིད།
en: Uḍḍiyāna, for its part,

source: །རྣ་བ་གཡས་པ་ཉིད་དུ་བརྗོད།
en: Is said to be in the right ear.

source: །རྩིབ་མའི་རྒྱབ་ནི་ཨརྦུ་ད།
en: “Arbuda is the backbone—

source: །བཞི་ནི་གནས་ཤེས་བྱ་བའོ།
en: These four are called pīṭha . Godāvarī is to be known

source: །རྣ་བ་གཡོན་པའི་རང་བཞིན་ནི། །དེ་བཞིན་གོ་དཱ་བ་རིར་ཤེས།
en: As having the same nature as the left ear.

source: །དགའ་བའི་དབང་ཕྱུག་བཤད་པ་ནི།
en: “Rāmeśvara is said to be

source: །སྨིན་མའི་དབུས་གནས་རབ་ཏུ་བསྐུལ།
en: In the eye between the eyebrows.

source: །དེ་བཞིན་མིག་དག་ལྷ་མོའི་མཁར།
en: Devīkoṭṭa is in the eyes,

source: །ལག་པའི་རྩ་བར་མ་ལ་བ།
en: And Mālava at the base of the arms.

source: །དེ་ལྟར་ཉེ་བར་གནས་ཉིད་དེ།
en: “Those just mentioned are auxiliary pīṭhas

source: །ཐུགས་ཀྱི་འཁོར་ལོར་རྣམ་པར་གནས།
en: They are established in the cakra of the mind.

source: །གནས་ཀྱི་ཁྱད་པར་རང་བཞིན་གྱི།
en: Based on the specific nature of these places,

source: །མཁའ་སྤྱོད་རྣམས་ཀྱི་ཡང་དག་བཤད།
en: They are said to belong to khecarīs.

source: །མཆན་ཁུང་ཀཱ་མ་རཱུ་པ་ཉིད།
en: “Kāmarūpa is in the armpit;

source: །ནུ་མ་ཨོ་དྲར་རབ་ཏུ་གྲགས།
en: Oḍra is proclaimed to be on the breasts.

source: །འདི་དག་ཞིང་དུ་ཡང་དག་བརྗོད།
en: These two are described as kṣetra

source: །ལྟེ་བ་ཏྲི་ཤ་ཀུ་ནིར་བརྗོད།
en: The navel is thought to be Triśakuni.

source: །སྣ་ཡི་རྩེ་མོར་ཀོ་ཤ་ལཱ།
en: “Kośala is the tip of the nose.

source: །ཉེ་བའི་ཞིང་དུ་བརྗོད་པའོ།
en: These last two are called auxiliary kṣetras

source: །ཁ་ནི་ཀ་ལིང་ཀ་རུ་བརྗོད།
en: Kaliṅga is said to be the mouth,

source: །མགྲིན་པ་ལམ་པ་ཀ་རུ་གསུངས།
en: And Lampāka, the throat.

source: །ཚན་དོ་ཧ་ཞེས་རྣམ་པར་བཤད།
en: “These two are called chandoha

source: །སྙིང་གི་ཀཱཉྩིར་བརྗོད་པ་སྟེ།
en: Kāñci is said to be in the heart;

source: །དབང་པོ་ཧི་མ་ལ་ཡ་ཉིད།
en: The phallus is Himālaya.

source: །ཉེ་བ་ཡི་ནི་ཚན་དོར་བརྗོད།
en: Thse two are called auxiliary chandohas

source: །དེ་ལྟར་ཡུལ་རྣམས་ཐམས་ཅད་དུ།
en: “All these places just mentioned

source: །གསུང་གི་འཁོར་ལོར་རྣམ་པར་གནས།
en: Are situated in the cakra of speech.

source: །གནས་ཀྱི་ཁྱད་པར་ཡུལ་གྱི་ནི།
en: Owing to the specifications of such places,

source: །ས་སྤྱོད་རྣམས་ཀྱི་ཡང་དག་བཤད།
en: They are said to belong to bhūcarīs.

source: །རྟགས་ལ་ཡི་དགས་ལྷག་པར་གནས།
en: “Pretādhivāsinī is in the sexual organ,

source: །གསང་བ་ལ་ནི་ཁྱིམ་གྱི་ལྷ།
en: While Gṛhadevatā is in the anus—

source: །འདི་དག་འདུ་བར་བརྗོད་པའོ།
en: These two are melāpakas

source: །བརླ་ནི་སཽ་རཱཥྚ་རུ་བརྗོད།
en: Saurāṣṭra is said to be in the thighs,

source: །རྗེ་ངར་གཉིས་ནི་གསེར་གླིང་གི།
en: “While the two shanks are said

source: །རང་གི་ངོ་བོར་རྣམ་པར་བཤད།
en: To have the nature of Suvarṇadvīpa.

source: །ཉེ་བ་ཡ་ནི་འདུ་བ་ཉིད།
en: The last two are auxiliary melāpakas

source: །སོར་མོ་ནཱ་ག་ར་རུ་བརྗོད།
en: Nagara is known to be in the fingers;

source: །རྐང་པའི་རྒྱབ་ནི་སིན་དྷུར་ངེས།
en: “Sindhu, on the back of the feet—

source: །དུར་ཁྲོད་དུ་ནི་ཡང་དག་བརྗོད།
en: These two are called charnel ground

source: །མཐེ་བོང་ལ་ནི་མ་རུ་ཟེར།
en: The thumb is said to be Maru,

source: །པུས་མོ་ཀུ་ལ་དཱ་རུ་བརྗོད།
en: And the knees, Kulatā.

source: །འདི་དག་ཉེ་བའི་དུར་ཁྲོད་ཉིད།
en: “The last two are called

source: །མཁའ་འགྲོ་མར་ནི་གསུངས་པའོ།
en: Auxiliary charnel ground by the ḍākinīs.

source: །འདི་དག་ཡུལ་དང་རང་ལུས་སྐྱེས།
en: All these are places and they are born with one’s own body—

source: །རང་གི་ནང་དང་ཕྱི་རོལ་གནས།
en: They are thus inside and outside oneself.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་འཁོར་ལོ་ལ།
en: “These are the places, within the cakras of the body, speech, and mind,

source: །ཉི་ཤུ་རྩ་བཞིར་ཕྱེ་བ་ཡིས།
en: That have a twenty-four-fold division.

source: །མཁའ་འགྲོ་མ་ནི་ཀུན་གྱི་གནས།
en: These places are always described

source: །ཐམས་ཅད་དུ་ནི་ཡང་དག་བཤད།
en: As associated with all manner of ḍākinīs.

source: །འདི་རྣམས་གནས་སུ་མཁའ་འགྲོ་མ།
en: “In these places dwell ḍākinīs

source: །རྩ་ཡི་གཟུགས་ཀྱིས་ཡང་དག་གནས།
en: In the form of subtle channels.”

source: །དྲུག་པ་ལས་རབ་ཏུ་བྱེད་པ་དང་པོའོ།།
en: This concludes the first part of the sixth chapter.

source: །།དེ་ནས་གཞན་ཡང་དམ་པའི་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཇི་ལྟར་གནས་སུ་སོན་པའི་རྩའི་འཁོར་ལོ་བཤད་པར་བྱའོ།
en: “Now I will explain the cakras of subtle channels according to their location in the body of a tathāgata, one that is present in every being.

source: །སྙིང་གི་ནང་སོང་པདྨ་ནི།
en: “The lotus cakra in the center of the chest

source: །དེ་ཡི་ནང་དུ་སོན་པའི་རྩ།
en: The channel located in its center

source: །མར་མེའི་རང་གི་ངོ་བོ་ཅན།
en: Has the appearance of the flame of an oil lamp. “It extends and faces down,

source: །ཆུ་ཤིང་གི་ནི་མེ་ཏོག་ལྟར། །བརྐྱང་ཞིང་ཁ་ནི་འོག་ཏུའོ།
en: Like a plantain flower.

source: །དེ་ཡི་ནང་གནས་དཔའ་བོ་ནི།
en: At its center dwells the virile one

source: །མི་ཤིགས་ཧཱུྃ་གི་ས་བོན་ནི།
en: “He has the form of the indestructible seed syllable hūṁ , Which flows and has the color of snow.

source: །ཁ་བ་ལྟ་བུར་འཛག་པ་ཉིད།
en: He is called Vasanta because, like spring,

source: །ལུས་ཅན་རྣམས་ཀྱི་སྙིང་དགའ་བ། །དཔྱིད་ཅེས་བྱ་བར་རྣམ་པར་བཤད།
en: He brings joy to the hearts of embodied beings.

source: །རྒོད་མའི་མེ་ཡི་གཟུགས་ཀྱིས་ནི།
en: “Nairātmyā, who has the appearance of vaḍabāgni fire,

source: །བདག་མེད་མ་ནི་ཐིག་ལེར་བརྗོད།
en: Is known as Tilakā.

source: །ལས་ཀྱི་རླུང་གིས་བསྐུལ་བ་ཡིས།
en: Fanned by the wind of karma,

source: །ལྟེ་བའི་དཀྱིལ་འཁོར་དུ་ནི་འབར།
en: She blazes in the navel cakra.

source: །དཔྱིད་ཐོབ་པ་ཡི་ཆོག་ཤེས་པས།
en: “Having reached Vasanta, she is gratified,

source: །སྙོམས་པར་འཇུག་པས་རྣམ་པར་གནས།
en: And becomes established in meditative absorption.

source: །དཔའ་བོ་ཤྲཱི་ནི་ཧེ་རུ་ཀ།
en: He is the glorious Heruka, the virile one;

source: །འདི་ནི་དཔྱིད་ཀྱི་ཐིག་ལེར་བརྗོད།
en: He is known as Vasantatilakā.

source: །རྣལ་འབྱོར་མ་ཡི་གཟུགས་འཛིན་མ།
en: “Taking the form of a yoginī,

source: །རྒྱུ་དང་མི་རྒྱུ་བཅས་པར་གནས།
en: He is present in the animate and the inanimate.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་དབྱེ་བས་ནི། །སྒོ་ནི་རྣམ་གསུམ་འབྱུང་བ་ལས།
en: While the winds emerge through the three types of openings, According to their division into body, speech, and mind,

source: །འགྲོ་བ་དང་ནི་འོང་བར་བྱེད།
en: “He enacts the goings and comings.

source: །འདི་ནི་ཀུན་གྱི་ལུས་ལ་གནས།
en: He dwells in everyone’s body.

source: །ལྟེ་བར་ཨ་ཡི་གཟུགས་ཀྱིས་ནི།
en: In the navel he takes the form of the letter a

source: །ཐུང་ངུ་རུ་ནི་རབ་ཏུ་གྲགས།
en: Which is said to be short.

source: །སྙིང་ལ་ཡང་ནི་ཧཱུྃ་ཉིད་ནི།
en: “In the heart, he abides as the syllable hūṁ

source: །རིང་པོ་མ་མོ་གཉིས་དང་གནས།
en: Which is two measures long.

source: །མགྲིན་པ་ཨོྃ་གྱི་གཟུགས་ཀྱིས་ནི།
en: In the throat he has the form of the syllable oṁ

source: །མ་མོ་གསུམ་བརྗོད་པ་ལུ་ཏ།
en: Which is said to be three measures long.

source: །དཔྲལ་བར་ཧྃ་གི་རྣམ་པ་འདི།
en: “In the forehead he has the form of the syllable haṁ

source: །སྒྲ་དང་ཐིག་ལེ་མི་ཤིགས་པ།
en: He is a sound and an indestructible drop.

source: །འཁོར་ལོ་པ་ཞི་ཡི་རབ་དབྱེ་བས།
en: According to his distribution between the cakras,

source: །ས་སོགས་འབྱུང་བ་ཆེན་པོ་དང་། །ཐུན་བཞིར་བྱིན་གྱིས་བརླབས་པ་དང་། །པདྨ་བཞི་ལས་བྱུང་བ་དང་། །དགའ་བ་བཞི་ཡི་ངོ་བོ་ཡིས།
en: He is the earth and the remaining great elements. “Presiding over the four temporal junctures, He emerges in each of the four lotuses. Being the essence of the four joys,

source: །རྣལ་འབྱོར་བཞི་ནི་མངོན་དུའོ།
en: He is wholly immersed in the practice of the four yogas.

source: །མཆོག་ཏུ་དགའ་བའི་ངོ་བོ་ཡིས།
en: “One in nature with the supreme joy,

source: །བྱ་དང་བྱེད་པའི་དངོས་པོ་ལས།
en: He assumes the modes of both the action and its agent.

source: །རྡོ་རྗེ་སེམས་དཔའི་གཟུགས་ཀྱིས་ནི།
en: In the form of Vajrasattva

source: །འདི་ནི་ཇི་ལྟར་བདེ་བར་རོལ།
en: He plays as he pleases in this body.

source: །འདབ་མ་རྣམས་ཀྱི་བཞི་ལ་ཡང་།
en: “On the four petals in the four directions

source: །འབྱུང་བ་བཞི་ཡི་རྩ་རྣམས་ནི།
en: Are situated The subtle channels of the four elements,

source: །མར་མེའི་རང་བཞིན་ལྟ་བུར་ནི།
en: Resembling oil lamp flames.

source: །ཕྱོགས་བཞི་ལ་ནི་རྣམ་པར་གནས།
en: “In the intermediate quarters

source: །རྩ་རྣམས་བཞི་ཡང་མཚམས་རྣམས་སུ། །རྣམ་པར་གནས་ཤིང་དེར་སོན་པའང་།
en: There are four subtle channels that extend to the other four.

source: །བདུད་རྩི་ལྔ་ནི་འབབ་པ་སྟེ།
en: They convey the five ambrosias

source: །དེ་མཆོད་རང་གི་གཟུགས་གནས་པས།
en: And assume forms particular to their respective types of worship.

source: །དེ་ཡི་དངོས་པོའི་ངོ་བོ་ལས།
en: “As they take on their respective forms

source: །མཆོད་པ་བཞི་ནི་རྣམ་པར་བཤད།
en: They are described as the four types of worship.

source: །ལུས་ཀྱི་སྙིང་གི་ནང་དུ་ནི།
en: Accordingly, the heart center of the body

source: །རྩ་ལྔ་རྣམས་ནི་རྣམ་པར་གནས།
en: Has five subtle channels situated in it.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་དབྱེ་བ་ཡིས།
en: “With the division into body, speech, and mind,

source: །ཉི་ཤུ་རྩ་བཞི་ཉེ་བར་བརྗོད། །གནས་སོགས་དགྱེ་བ་ལ་གནས་ནས།
en: There are said to be twenty-four subtle channels.

source: །གནས་དང་གནས་ལ་རྣམ་པར་གནས།
en: They are each situated in their particular places,

source: །སྤྱི་བོར་ཡང་དག་བྱུང་བ་ཡི།
en: Following the divisions of pīṭhas, and so forth. “The channels that originate in the head

source: །རྩ་ནི་སྤྱི་བོ་སྐྱེས་ཞེས་བརྗོད། །རྡུལ་དང་སྙིང་སྟོབས་མུན་པའི་ཚུལ།
en: Are known as head-born

source: །དེ་ཡི་ནང་ན་ཙོ་མོ་ནི།
en: The main ones among them are those With the natures of rajas , sattvam , and tamas , respectively.

source: །པུལླཱི་རར་ནི་མི་ཕྱེད་མ།
en: “The one in Pullīra, called Abhedyā,

source: །སོ་དང་སེན་མོ་འབབ་པར་བརྗོད།
en: Is known to nourish the nails and teeth.

source: །འབར་བ་འཛིན་པ་གྲ་གཟུགས་མ།
en: The one in Jālandhara, called Sūkṣmarūpā,

source: །དེ་བཞིན་སྐྲ་དང་བ་སྤུ་འབབ།
en: Nourishes the hair of the scalp and the body. “The one called Divyā is situated

source: །ཨོ་ཌྱཱན་གནས་ནི་ཆེན་པོ་ལ། །རྩེ་བ་མ་ནི་རྣམ་པར་གནས།
en: In the great pīṭha of Uḍḍiyāna;

source: །རྣ་བ་གཡས་པར་གནས་ནས་ནི།
en: Located in the right ear,

source: །པགས་པ་དྲི་མ་འབབ་མ་གནས།
en: She nourishes the skin and its hair.

source: །ཨུརྦུ་དར་ནི་གཡོན་པ་མ།
en: “In Arbuda, the ḍākinī Vāmā

source: །མཁའ་འགྲོ་མ་ནི་ཤ་འབབ་མ།
en: Nourishes the flesh.

source: །གང་ཞིག་ཆུ་རྒྱུས་འབབ་པའི་རྩ།
en: The one that courses through the sinews and tendons

source: །བ་ཡི་མཆོག་སྦྱིན་རྣམ་པར་གནས།
en: Is situated in Godāvarī; “It is called Vāmanī

source: །དེ་ནི་སྲ་པའི་ཚུལ་གྱིས་གནས།
en: And abides in a hard form.

source: །ཐུང་དུ་མར་ནི་རྣམ་པར་བཤད། །གང་ཞིག་དགའ་བའི་དབང་ཕྱུག་རྩ།
en: The one in Rāmeśvara

source: །དེ་བཞིན་རུས་སྦལ་སྐྱེས་མར་གྲགས།
en: Is commonly known as Kūrmajā;

source: །སྲ་བའི་དངོས་པོས་གནས་པའི་ཕྱིར།
en: “Because of her hard form,

source: །རུས་པའི་ཕྲེང་བ་འཁྲུགས་པར་གནས།
en: She abides as a bone necklace.

source: །ལྷ་མོའི་མཁར་དུ་གང་ཞིག་རྩ།
en: The one in Devīkoṭṭa

source: །འཇམ་པ་སྒོམ་པ་མ་རུ་བརྗོད།
en: Has a soft form, and is called Bhāvikī;

source: །དེ་ནི་རྟག་ཏུ་མཆིན་པ་འབབ།
en: “She nourishes the heart

source: །ཐམས་ཅད་ལུས་ལ་རྟག་པར་གནས།
en: And is always present in every living body.

source: །མཱ་ལ་བར་ནི་དབང་མ་ནི།
en: Sekā is in Mālava;

source: །རྒྱལ་བའི་དབང་ཕྱུག་སྙིང་ལ་གནས།
en: Located in the heart, she is the queen of the victorious ones.

source: །རྩ་ནི་གང་ཞིག་མིག་འབབ་མ།
en: “The one that nourishes the eyes

source: །འདོད་པའི་གཟུགས་སུ་རྣམ་པར་གནས།
en: Is situated in Kāmarūpa; It is called Dveṣāvatī

source: །གཟུགས་ནི་མཐོང་བར་འདོད་པ་སྟེ། །སྐྱོན་བྲལ་མ་ཞེས་རྣམ་པར་བཤད།
en: And is claimed to have a visible form.

source: །ཨོ་ཌིར་མཁྲིས་པ་འབབ་པའི་རྩ།
en: “The one in Oḍra carries bile;

source: །གང་ཞིག་འཇུག་མ་ཆེན་མོར་བརྗོད།
en: She is known as Mahāviṣṭā.

source: །ཏྲི་ཤ་ཀུ་ནེར་བྱུང་བ་ནི།
en: Mātarā, born in Triśakuni,

source: །མ་མོ་ངེས་པར་གློ་བར་བཅས།
en: Is connected with the lungs.

source: །ཀོ་ཤ་ལར་ནི་མཚན་མོ་ཉིད།
en: “The divine Śavarī, who wears a garland of intestines,

source: །རྒྱུ་མའི་ཕྲེང་བཟང་ཁྱབ་ཅིང་འབབ།
en: Flows through Kośala.

source: །ཀ་ལིང་ཀར་ནི་བསིལ་སྦྱིན་མ།
en: Śītadā is in Kaliṅga;

source: །ངོས་ཀྱི་ཆུ་རྒྱུས་ཡང་དག་བཤད།
en: She flows through the sides.

source: །ཚ་བ་མ་ནི་ལྟོ་གནས་ངེས།
en: “Uṣmā, who resides in the abdomen,

source: །ལམ་པཱ་ཀར་ནི་རབ་ཏུ་གྲགས།
en: Is the one known in Lampāka.

source: །འབབ་མ་ཉིད་ནི་ཀཱཉྩིར་གནས།
en: Pramāṇā, who resides in Kāñcī,

source: །ཐམས་ཅད་དུ་ནི་བཤང་བ་འབབ།
en: Always carries the feces. “Hṛṣṭavadanā, in Himālaya,

source: །མཚམས་ཀྱི་མཐའ་ཡི་ནང་དུ་ཡང་།
en: Extends from the center of the body to the extremities.

source: །ཁ་བའི་གནས་སུ་རངས་མའི་གདོང་།
en: Svarūpiṇī, located in Pretādhivāsinī,

source: །ཤིན་ཏུ་གཟུགས་ཅན་བད་ཀན་ལྡན། །ཡི་དགས་ལྷ་གནས་ཡང་དག་གནས།
en: Carries phlegm.

source: །གང་ཞིག་རྟག་ཏུ་རྣག་འབབ་པ།
en: “The one that always carries pus

source: །ཁྱིམ་གྱི་ལྷར་ནི་ཡང་དག་གནས།
en: Is located in Gṛhadevatā— She is called Sāmānyā,

source: །མཁའ་འགྲོ་དམ་པའི་དབང་ཕྱུག་གིས། །སྤྱི་མ་ཉིད་དུ་རྣམ་པར་བཤད།
en: The supreme goddess ḍākinī.

source: །སོ་རཱཥྚར་ནི་གང་ཞིག་རྩ།
en: “The one that flows through Sauraṣṭra

source: །རྒྱུ་སྦྱིན་མ་ནི་དམར་པོ་འབབ།
en: Is called Hetudāyikā and contains blood.

source: །རྡུལ་ནི་འབབ་པར་གྱུར་པ་ནི།
en: The one that carries sweat

source: །གསེར་གླིང་དུ་ནི་ཡང་དག་བཤད།
en: Is located in Suvarṇadvīpa;

source: །ཡན་ལག་གཟི་བརྗིད་ཀུན་ཁྱབ་མ།
en: “Turbulent and with a flaming body,

source: །སྦྱོར་བྲལ་མར་ནི་རབ་ཏུ་གྲགས།
en: She is known as Viyogā.

source: །ནཱ་ག་རར་ནི་སྡུ་གུ་མ།
en: Premaṇī is in Nagara;

source: །ཚིལ་ཅན་སྦོམ་ཞིང་མྱོས་བྱེད་འབབ།
en: She is thick with fat and also carries semen.

source: །སིན་དྷུར་ཤིན་ཏུ་གྲུབ་པ་ཉིད།
en: “In Sindhu there is Siddhā;

source: །མྱ་ངན་མཆི་མ་འབབ་མར་བརྗོད།
en: She is thought to carry tears of grief.

source: །མ་རུར་གནས་མ་ལུད་སྐམ་འབབ།
en: The one in Maru carries phlegm;

source: །འཚེད་པ་མ་ཞེས་རྣམ་པར་བསྟན།
en: She should go by the name Pāvakī.

source: །གུ་ལུ་ཏྭར་ནི་ཡིད་བཟང་མ།
en: “Sumanā is in Kulatā;

source: །ཤ་དང་སྣབས་ནི་འབབ་མའོ།
en: She carries saliva and snot.”

source: །དྲུག་པ་ལས་ཡུལ་གྱི་དགོད་པ་སྟེ་རབ་ཏུ་བྱེད་པ་གཉིས་པའོ།།
en: This concludes the second part of the sixth chapter on the placement of the sites.

source: །།ལྷ་ལགས་མཉན་པར་འཚལ་ལགས་ན། །ནང་གི་དཀྱིལ་འཁོར་མཆོད་པ་ལ། །སོགས་པའི་ལས་ནི་ཇི་ལྟར་ལགས།
en: “I would like to hear, O lord, how to perform the worship, and so forth, of the inner maṇḍala.

source: །སྦྱིན་སྲེག་ལས་ནི་མི་འཚལ་བས།
en: I do not know the procedure for the burnt offering rite.

source: །བདེ་བ་ཆེན་པོས་བཤད་དུ་གསོལ།
en: Please explain it, O Great Bliss.”

source: །ཧེ་རུ་ལ་སོགས་པའི་ལྷ།
en: “Deities such as the herukas, and so forth,

source: །རྩ་གཟུགས་མཛེས་པར་ཡང་དག་བྱུང་།
en: Exquisitely manifest in the form of the subtle channels.

source: །ལུས་ཀྱི་དཀྱིལ་འཁོར་ཉམས་དགའ་བར།
en: The body is a delightful maṇḍala,

source: །སྒོ་བཞིར་ཇི་སྐད་གསུངས་པའོ།
en: Which has four gates, as has been described.

source: །རང་གི་ཡན་ལག་བརྒྱད་བྱུང་བས།
en: “Its eight pillars being the eight limbs of one’s body,

source: །ཀ་བ་དེ་ཡིས་བསྐོར་ནས་གནས།
en: The maṇḍala is always encircled by them.

source: །དངོས་པོ་ཀུན་གྱིས་མཉམ་པའི་ཕྱིར།
en: Because of the equality among all things,

source: །གྲུ་བཞི་བར་ནི་རབ་ཏུ་གྲགས།
en: It is known to be symmetrical, with four sides.

source: །སྐུ་གསུང་ཐུགས་ཀྱི་ངོ་བོས་ནི།
en: “Being in essence body, speech, and mind, respectively,

source: །དཀྱིལ་འཁོར་འཁོར་ལོ་གཅིག་ཏུ་གསུངས།
en: The three cakras are said to be a single one.

source: །རི་ནི་མགོ་བོའི་ཟེ་འབྲུ་ལ།
en: On the stamens of the lotus on top of one’s head, which is Mount Meru,

source: །ཇི་ལྟར་རྩོམ་ཆེན་ལ་སོགས་རིམ།
en: There is Vairambhaka and the other three winds, in their right order. “This maṇḍala is present, having manifested

source: །བླ་མའི་དུས་ཐབས་རིམ་ཉིད་ཀྱིས། །དེ་ནི་རྫོགས་པའི་དཀྱིལ་འཁོར་གནས།
en: Through the two stages, as handed down by the succession of gurus.

source: །རྐང་པའི་མཐིལ་དུ་རྩོམ་ཆེན་རླུང་།
en: On the soles of the feet there is the Vairambha wind

source: །གཞུ་ཡི་དབྱིབས་སུ་རྣམ་པར་གནས།
en: In the shape of a bow.

source: །སུམ་མདོ་ཡི་ནི་གནས་སུ་ནི།
en: “Located in the triangular area of the abdomen

source: །དེ་བཞིན་གྲུ་གསུམ་འབར་བ་ཉིད།
en: Is the blazing triangle.

source: །ཟླུམ་པོའི་རྣམ་པའི་དབྱིབས་ཀྱིས་ནི།
en: The element of water, in the form of a circle,

source: །ཆུ་ནི་ལྟེ་བར་རྣམ་པར་གནས།
en: Is located in the abdomen.

source: །སྙིང་གར་ཡང་ནི་ས་ཉིད་དེ།
en: “In the heart area there is the earth element,

source: །ཀུན་ནས་གྲུ་བཞི་པ་ཉིད་དོ།
en: Symmetrically quadrangular in form.

source: །སྒལ་ཚིགས་དབྱུག་གུའི་གཟུགས་ཀྱིས་ནི།
en: The spinal column, with the form of a staff,

source: །རི་རབ་རི་རྒྱལ་དེ་བཞིན་ནོ། །དེར་ནི་སྤྱི་བོའི་ཆར་གནས།
en: Is just like Sumeru, the king of mountains.

source: །འདམ་སྐྱེས་འདབ་མ་སུམ་བཅུ་གཉིས།
en: “On a lotus with thirty-two petals, Located in the area of the head,

source: །དབྱངས་དང་གསལ་བྱེད་མཛེས་པར་གནས།
en: The vowels and consonants are exquisitely present—

source: །སུམ་ཅུ་རྩ་གཉིས་བྱང་ཆུབ་འདོད།
en: They are claimed to be the thirty-two-fold bodhicitta.

source: །པདྨའི་ནང་དུ་སོན་པ་གང་།
en: “That which is in the center of the lotus

source: །དེ་ནི་ཟླ་བའི་དཀྱིལ་འཁོར་བརྗོད།
en: Is, for its part, described as a moon disk.

source: །སྤྱི་བོའི་ནང་དུ་ཀླད་པ་ནི།
en: The brain inside the head

source: །གང་ཞིག་གནས་པ་དེ་རུ་གསུངས།
en: Is what is said to be present there.

source: །དེ་ནང་ཧྃ་གི་རྣམ་པ་ཉིད།
en: “In its center is the syllable hūṁ

source: །ཐིག་ལེའི་གཟུགས་ཅན་མི་ཤིགས་པ།
en: Indestructible, in the form of a drop of ambrosia.

source: །འཇིག་རྟེན་ཀུན་གྱི་རྩ་བ་དེ།
en: All beings have their foundation in this,

source: །བརྟན་པའི་བདག་ཉིད་གཡོ་བའི་བདག །གསལ་དང་མི་གསལ་གཟུགས་ལས་ནི།
en: As it is the mainstay of animate and inanimate entities.

source: །ས་བོན་གཟུགས་ཀྱི་རྣམ་པར་གནས།
en: “Their existence is in the form of this seed syllable, Whether it takes manifest or unmanifest forms.

source: །ལུས་ཅན་རྣམས་ནི་ཀུན་གྱི་གཟུགས།
en: The forms of all embodied beings

source: །དེ་ཕྱིར་གདོད་ནས་རྫོགས་པ་ཉིད། །བདུད་རྩིའི་གཟུགས་ཀྱིས་འཛག་པར་ནི།
en: Are therefore complete from the beginning.
